_posts/editor/2019-03-11-spacemacs-magit.html
---
layout: post
title: "Spacemacs MaGit 学习"
date: 2019-03-11
categories: 文本编辑
tags:
    - Spacemacs
    - Git
---

<div id="outline-container-orga332c69" class="outline-2">
<h2 id="orga332c69"><span class="section-number-2">1</span> 配置 Magit</h2>
<div class="outline-text-2" id="text-1">
<p>
Git 是一个优秀的版本控制工具，我们可以在 .spacemacs 的 <code>dotspacemacs-configuration-layers</code> 列表中添加 git 就可以集成 git 了。
</p>

<p>
<b>下面是一些常用的 git 命令，前缀为 <code>SPC g</code></b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Git</th>
<th scope="col" class="org-left">Magit</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">git init</td>
<td class="org-left">SPC g i</td>
</tr>

<tr>
<td class="org-left">git status</td>
<td class="org-left">SPC g s</td>
</tr>

<tr>
<td class="org-left">git add</td>
<td class="org-left">SPC g s 弹出层选中文件然后按 s</td>
</tr>

<tr>
<td class="org-left">git add currentFile</td>
<td class="org-left">SPC g S</td>
</tr>

<tr>
<td class="org-left">git commit</td>
<td class="org-left">SPC g c c</td>
</tr>

<tr>
<td class="org-left">git push</td>
<td class="org-left">SPC g P 按提示操作</td>
</tr>

<tr>
<td class="org-left">git checkout xxx</td>
<td class="org-left">SPC g C</td>
</tr>

<tr>
<td class="org-left">git checkout &#x2013; xxx</td>
<td class="org-left">SPC g s 弹出层选中文件然后按 u</td>
</tr>

<tr>
<td class="org-left">git log</td>
<td class="org-left">SPC g l l</td>
</tr>
</tbody>
</table>

<p>
大部分命令整合到 SPC g s 中，需要按照提示执行命令
</p>

<p>
在 commit 时，我们输入完 commit message 之后，需要按 <code>C-c C-c</code> 来完成 commit 操作，也可以按  <code>C-c C-k</code> 来取消 commit。
</p>
</div>
</div>

<div id="outline-container-org2f31728" class="outline-2">
<h2 id="org2f31728"><span class="section-number-2">2</span> MaGit 状态窗口</h2>
<div class="outline-text-2" id="text-2">
<p>
比 git status 显示的信息更加方便，并且也是管理窗口，可以在这里使用很多快捷命令。
只要在一个 git 目录里面，按下 <code>M-m g s</code> ，就会弹出 magit 状态窗口
</p>

<p>
比如下面显示有两个文件处于 staged 状态，就是可以被提交
</p>

<div class="org-src-container">
<pre class="src src-text">Staged changes (2)
modified a.html
modified a.org
</pre>
</div>
</div>
</div>

<div id="outline-container-org6cd34d1" class="outline-2">
<h2 id="org6cd34d1"><span class="section-number-2">3</span> 查看 refs</h2>
<div class="outline-text-2" id="text-3">
<p>
按下 <code>y</code>  键即可
可以看到 git 地址，branch 名称和 tag 名称
</p>
</div>
</div>

<div id="outline-container-org8b715ff" class="outline-2">
<h2 id="org8b715ff"><span class="section-number-2">4</span> git add -u 的替代方法</h2>
<div class="outline-text-2" id="text-4">
<p>
在正在编辑的文件上，按下 <code>M-m g S</code>, 将当前文件变成 staged 状态。
</p>
</div>
</div>

<div id="outline-container-orgb6bd13f" class="outline-2">
<h2 id="orgb6bd13f"><span class="section-number-2">5</span> unstage 文件</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><code>u</code> 当前文件被 unstage</li>
<li><code>U</code> 所有文件被 unstage</li>
</ul>
</div>
</div>


<div id="outline-container-orgda1f609" class="outline-2">
<h2 id="orgda1f609"><span class="section-number-2">6</span> git commit 的更好的用法</h2>
<div class="outline-text-2" id="text-6">
<p>
反复敲命令 <code>git commit -m</code> 也挺累, 这里用快捷键
</p>

<p>
在前面打开的 magit status 窗口，按两下 <code>c c</code> ，然后会弹出新的 buffer，让输入 commit message,同时还会出现 diff 的 buffer,提示这次提交的代码做了哪些修改。
</p>

<p>
输入 message 后，然后按 <code>C-c C-c</code> ， 提交；
输入 message 后，然后按 <code>C-c C-k</code> ， 取消。
</p>
</div>
</div>


<div id="outline-container-orgfe25b41" class="outline-2">
<h2 id="orgfe25b41"><span class="section-number-2">7</span> git push 的替代方法</h2>
<div class="outline-text-2" id="text-7">
<p>
在 status buffer 上，按下 <code>P m</code> 。
</p>
</div>
</div>

<div id="outline-container-org85f4f9d" class="outline-2">
<h2 id="org85f4f9d"><span class="section-number-2">8</span> git log 的替代方法</h2>
<div class="outline-text-2" id="text-8">
<p>
在 status buffer 上，按下 <code>l l</code> 。
</p>
</div>
</div>



<div id="outline-container-orgfd37edc" class="outline-2">
<h2 id="orgfd37edc"><span class="section-number-2">9</span> git tag 管理</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgdb6b94c" class="outline-3">
<h3 id="orgdb6b94c"><span class="section-number-3">9.1</span> 创建 tag </h3>
<div class="outline-text-3" id="text-9-1">
<p>
在 status buffer 上按下 <code>t t</code> ，然后输入 tag 名称，并指定 branch 名称，就可以在本地创建 tag 了
</p>
</div>
</div>

<div id="outline-container-org6837dc5" class="outline-3">
<h3 id="org6837dc5"><span class="section-number-3">9.2</span> push tag</h3>
<div class="outline-text-3" id="text-9-2">
<p>
在 status buffer 上按下 <code>P T</code> 即可。
</p>
</div>
</div>

<div id="outline-container-orgfeeb952" class="outline-3">
<h3 id="orgfeeb952"><span class="section-number-3">9.3</span> 显示 tag</h3>
<div class="outline-text-3" id="text-9-3">
<p>
仍然是 <code>l l</code> 。
</p>
</div>
</div>
</div>



<div id="outline-container-orgbe0aa58" class="outline-2">
<h2 id="orgbe0aa58"><span class="section-number-2">10</span> git diff</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgd26671b" class="outline-3">
<h3 id="orgd26671b"><span class="section-number-3">10.1</span> 对过去的 commit 进行 diff</h3>
<div class="outline-text-3" id="text-10-1">
<p>
选中一批，然后 <code>d r</code> ，就会显示差异
</p>
</div>
</div>

<div id="outline-container-org4e2c724" class="outline-3">
<h3 id="org4e2c724"><span class="section-number-3">10.2</span> 当前工作区的修改文件和仓库里面的 diff</h3>
<div class="outline-text-3" id="text-10-2">
<p>
对某个文件修改，保存但不提交，然后用 <code>d d</code> 来查看修改可哪些东西。如果觉得不合适，可以用 emacs 回退操作。
</p>
</div>
</div>
</div>

<div id="outline-container-org4ebb8e9" class="outline-2">
<h2 id="org4ebb8e9"><span class="section-number-2">11</span> 从远程同步</h2>
<div class="outline-text-2" id="text-11">
<p>
git fetch 在 status buffer 上按下 <code>f u</code> 。
git pull 在 status buffer 上按下 <code>F u</code> 。
</p>
</div>
</div>

<div id="outline-container-orgba1f082" class="outline-2">
<h2 id="orgba1f082"><span class="section-number-2">12</span> branch 操作</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org8e63517" class="outline-3">
<h3 id="org8e63517"><span class="section-number-3">12.1</span> 查看本地 branch</h3>
<div class="outline-text-3" id="text-12-1">
<p>
在 status buffer 上按下 <code>y</code> 。
</p>
</div>
</div>

<div id="outline-container-org01e8a94" class="outline-3">
<h3 id="org01e8a94"><span class="section-number-3">12.2</span> 切换 branch</h3>
<div class="outline-text-3" id="text-12-2">
<p>
status buffer 上按下 <code>b</code> 键，进入 branch 管理界面，按下 <code>b</code> 就可以切换。
创建新 branch 可以使用 <code>c</code> ，根据当前 branch 创建新 branch，类似于 <code>checkout -b newBranch</code> 。
</p>
</div>
</div>

<div id="outline-container-org3cb97c2" class="outline-3">
<h3 id="org3cb97c2"><span class="section-number-3">12.3</span> merge</h3>
<div class="outline-text-3" id="text-12-3">
<p>
如果想把 develop branch 的代码合并到 master branch。应该
</p>

<ol class="org-ol">
<li>切换到 master branch（目标 branch)</li>

<li>按下 m 键，然后再按一次 m 运行 Merge Action.</li>
</ol>

<p>
选择 develop branch (源 branch), 回车。
</p>

<p>
<a href="https://magit.vc/manual/magit/Diffing.html">magit diff 操作参考</a>
</p>
</div>
</div>
</div>
